openfoam/run/taylor_green_re1000/0/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
dimensions      [0 2 -2 0 0 0 0];
internalField   nonuniform List<scalar>
4096
(
0.4975923633
0.4880312656
0.4692764978
0.4420487950
0.4073945027
0.3666453659
0.3213673510
0.2733004668
...
)
;

boundaryField
{
    left         { type cyclic; }
    right        { type cyclic; }
    top          { type cyclic; }
    bottom       { type cyclic; }
    frontAndBack { type empty; }
}
