openfoam/run/taylor_green_re1000/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          64;
        startFace       8064;
        matchTolerance  0.0001;
        neighbourPatch  bottom;
        transformType   translational;
        separation      (0 6.2832 0);
    }
    bottom
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          64;
        startFace       8128;
        matchTolerance  0.0001;
        neighbourPatch  top;
        transformType   translational;
        separation      (0 -6.2832 0);
    }
    left
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          64;
        startFace       8192;
        matchTolerance  0.0001;
        neighbourPatch  right;
        transformType   translational;
        separation      (-6.2832 0 0);
    }
    right
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          64;
        startFace       8256;
        matchTolerance  0.0001;
        neighbourPatch  left;
        transformType   translational;
        separation      (6.2832 0 0);
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          8192;
        startFace       8320;
    }
)

// ************************************************************************* //
