openfoam/run/taylor_green_re1000/system/controlDict
  FoamFile
  {
      format      ascii;
      class       dictionary;
      location    "system";
      object      controlDict;
  }

  application     icoFoam;
  startFrom       startTime;
  startTime       0;
  stopAt          endTime;
  endTime         20;
  deltaT          0.001;
  writeControl    runTime;
  writeInterval   1;
  purgeWrite      0;
  writeFormat     ascii;
  writePrecision  6;
  runTimeModifiable true;


