openfoam/run/taylor_green_re1000/system/fvSchemes
FoamFile { version 2.0; format ascii; class dictionary; location "system"; object fvSchemes; }

ddtSchemes      { default Euler; }
gradSchemes     { default Gauss linear; }
divSchemes      { default none; div(phi,U) Gauss linearUpwind grad(U); }
laplacianSchemes { default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes   { default corrected; }
