openfoam/run/taylor_green_re1000/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; location "system"; object fvSolution; }

solvers
{
    p      { solver PCG; preconditioner DIC; tolerance 1e-8; relTol 0.01; }
    pFinal { solver PCG; preconditioner DIC; tolerance 1e-8; relTol 0;    }
    U      { solver PBiCGStab; preconditioner DILU; tolerance 1e-8; relTol 0.1; }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}
